package com.example.hi.tool;

//一个资源类，存一些我需要的东西
public class help_data {
    public String[] messages;
    public String[] helps;
    public help_data() {
        helps=new String[]{
                "阅读记忆法 也就是把词汇的记忆融入阅读之中，在看一篇文章的时候，遇到不认识的单词先做记号，并猜测它们的含义，等到把全文看完后再从字典上把它们的意思找出来。就自我感觉来说，这种方法不枯燥，记得比较牢，但缺点是记忆的词汇量比较少，而且耗时也比较长，不适合想求速成的同学。",
                "笔记记忆法 我的灵感来源于一篇文章，说某君从不背书，只抄书，每一本书都被他 抄了几遍，这样最后全数的内容都印在了他的脑海中。这大概是书上的铅字经自己用笔抄下来后，好象就成了自己的东西，对自己就没有排斥反应了。我的具体做法是找一本笔记本，把它的一页按中间对折，然后从字典上把英汉意思抄上去，英语单词或词组抄在左边，汉语意思抄在右边。然后对所有的词汇背三遍，先英汉对照背一遍，然后分别只看英文或只看汉语解释背一遍（把页面折起来，使自己看不到英文或中文部分，以免受干扰）。这种方法记忆的量大而且比较牢靠，只是需要不怕累的人才能做到。",
                " 间隔反复记忆法 我曾经听到过这样一个例子：如果你盯着一个人连续看三个小时，但以后再也看不到他了，那么也许一两个月后你就把他的长相给忘了，但是如果你把这三个小时分配到许多天中，每天只看那个人一两分钟，这样下去，你就一辈子都不会忘记他的长相。我的方法就是根据这得出的。我的做法就是先规定自己一天背的词汇的数量，然后在一天中每隔一段时间把这些词汇通背一遍，相隔的时间不宜太短，以2-3小时为宜，早上背一遍，中午背一遍，下午背一遍，晚上再背一遍或两遍。隔几天后再把这些背过一遍。如此循环下去，会收到很好的记忆效果。这种方法适合于时间比较充沛，可以专门用一段时间来学英语的人。它的特点是可以在短期内记到大量的单词，而且可以记得较牢，它的缺点就是非常枯燥，要有毅力的人才能坚持背下去。",
                "“勤”即勤于查词典。遇到不会的单词先猜，猜不出再查，不要一遇到就查，这样 不利于自己记忆的（所谓不经过努力得到的是不会珍惜的）。查的过程中，切忌仅仅限于所查的单词。譬如在查respect的时候，就应该做到“一目十行”。此时一定要勤。也就是在查该单词的时候，应该注意它的前后几个单词。因为它的前后几个往往就",
                "“联”即联想记忆法。看到某个单词，应该回想一下，有没有和自己以前记忆的单词在形或意思方面的近似。譬如，遇到consult,就应该想到和外形差不多的单词，如 result ,insult等，这样就会记忆一个单词的同时又复习了其它的单词，而且不致于混淆。再如，学习fetch的时候，就应该想到它和take ,bring ,carry 等单词在用法上的区别。当然，很简单的单词（已经掌握的）就不必如此，因人而异。",
                "如何修改个人信息'\n'如何更改手机号'\n'如何退出账号'\n'如何注销账号",
                "如何删除单词'\n'如何收藏单词'\n'如何切换词书",
                "如何有效记忆单词'\n'为什么页面显示不对劲",
        };

        messages=new String[]{
                "阅读记忆法",
                "笔记记忆法",
                "间隔反复记忆法",
                "“勤”即勤于查词典",
                "“联”即联想记忆法",
                "个人账号问题",
                "功能相关问题",
                "学习相关问题"
        };
    }
}
